# MarbleSize Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Marble..::..MarbleSize Property
Marble Class See Also
---
The property labeled "Vein Spacing" from the "Marble" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MarbleSize { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MarbleSize As String
	Get
```

Visual C++
---
```text
public:
static property String^ MarbleSize {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 100".
# See Also
Marble Class
Autodesk.Revit.DB.Visual Namespace